cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(And, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x61);

  MCInst Andh;
  Andh.setOpcode(AVR32::ANDHri);
  Andh.addOperand(MCOperand::createReg(AVR32::R1));
  Andh.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Andh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst AndhCOH;
  AndhCOH.setOpcode(AVR32::ANDHri_COH);
  AndhCOH.addOperand(MCOperand::createReg(AVR32::R1));
  AndhCOH.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(AndhCOH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Andl;
  Andl.setOpcode(AVR32::ANDLri);
  Andl.addOperand(MCOperand::createReg(AVR32::R1));
  Andl.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Andl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst AndlCOH;
  AndlCOH.setOpcode(AVR32::ANDLri_COH);
  AndlCOH.addOperand(MCOperand::createReg(AVR32::R1));
  AndlCOH.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(AndlCOH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst AndEq;
  AndEq.setOpcode(AVR32::ANDEQrrr);
  AndEq.addOperand(MCOperand::createReg(AVR32::R1));
  AndEq.addOperand(MCOperand::createReg(AVR32::R2));
  AndEq.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(AndEq, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst AndAl;
  AndAl.setOpcode(AVR32::ANDALrrr);
  AndAl.addOperand(MCOperand::createReg(AVR32::R1));
  AndAl.addOperand(MCOperand::createReg(AVR32::R2));
  AndAl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(AndAl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst Andn;
  Andn.setOpcode(AVR32::ANDNrr);
  Andn.addOperand(MCOperand::createReg(AVR32::R1));
  Andn.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Andn, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x81);

  MCInst Asr;
  Asr.setOpcode(AVR32::ASRrrr);
  Asr.addOperand(MCOperand::createReg(AVR32::R1));
  Asr.addOperand(MCOperand::createReg(AVR32::R2));
  Asr.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Asr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x08);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Bfexts;
  Bfexts.setOpcode(AVR32::BFEXTS);
  Bfexts.addOperand(MCOperand::createReg(AVR32::R1));
  Bfexts.addOperand(MCOperand::createReg(AVR32::R2));
  Bfexts.addOperand(MCOperand::createImm(3));
  Bfexts.addOperand(MCOperand::createImm(5));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Bfexts, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xb0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x65);

  MCInst Bfextu;
  Bfextu.setOpcode(AVR32::BFEXTU);
  Bfextu.addOperand(MCOperand::createReg(AVR32::R1));
  Bfextu.addOperand(MCOperand::createReg(AVR32::R2));
  Bfextu.addOperand(MCOperand::createImm(3));
  Bfextu.addOperand(MCOperand::createImm(5));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Bfextu, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xc0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x65);

  MCInst Bfins;
  Bfins.setOpcode(AVR32::BFINS);
  Bfins.addOperand(MCOperand::createReg(AVR32::R1));
  Bfins.addOperand(MCOperand::createReg(AVR32::R2));
  Bfins.addOperand(MCOperand::createImm(3));
  Bfins.addOperand(MCOperand::createImm(5));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Bfins, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xd0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x65);

  MCInst Bld;
  Bld.setOpcode(AVR32::BLDri);
  Bld.addOperand(MCOperand::createReg(AVR32::R1));
  Bld.addOperand(MCOperand::createImm(1));

