cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Eorl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xec);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst EorEq;
  EorEq.setOpcode(AVR32::EOREQrrr);
  EorEq.addOperand(MCOperand::createReg(AVR32::R1));
  EorEq.addOperand(MCOperand::createReg(AVR32::R2));
  EorEq.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(EorEq, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst EorAl;
  EorAl.setOpcode(AVR32::EORALrrr);
  EorAl.addOperand(MCOperand::createReg(AVR32::R1));
  EorAl.addOperand(MCOperand::createReg(AVR32::R2));
  EorAl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(EorAl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Frs;
  Frs.setOpcode(AVR32::FRS);

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Frs, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x43);

  MCInst FaddS;
  FaddS.setOpcode(AVR32::FADD_Srrr);
  FaddS.addOperand(MCOperand::createReg(AVR32::R1));
  FaddS.addOperand(MCOperand::createReg(AVR32::R2));
  FaddS.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FaddS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa0);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x23);

  MCInst FsubS;
  FsubS.setOpcode(AVR32::FSUB_Srrr);
  FsubS.addOperand(MCOperand::createReg(AVR32::R1));
  FsubS.addOperand(MCOperand::createReg(AVR32::R2));
  FsubS.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FsubS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x23);

  MCInst FmulS;
  FmulS.setOpcode(AVR32::FMUL_Srrr);
  FmulS.addOperand(MCOperand::createReg(AVR32::R1));
  FmulS.addOperand(MCOperand::createReg(AVR32::R2));
  FmulS.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FmulS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x23);

  MCInst FnmulS;
  FnmulS.setOpcode(AVR32::FNMUL_Srrr);
  FnmulS.addOperand(MCOperand::createReg(AVR32::R1));
  FnmulS.addOperand(MCOperand::createReg(AVR32::R2));
  FnmulS.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FnmulS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x23);

  MCInst FmacS;
  FmacS.setOpcode(AVR32::FMAC_Srrrr);
  FmacS.addOperand(MCOperand::createReg(AVR32::R1));
  FmacS.addOperand(MCOperand::createReg(AVR32::R2));
  FmacS.addOperand(MCOperand::createReg(AVR32::R3));
  FmacS.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FmacS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst FnmacS;
  FnmacS.setOpcode(AVR32::FNMAC_Srrrr);
  FnmacS.addOperand(MCOperand::createReg(AVR32::R1));
  FnmacS.addOperand(MCOperand::createReg(AVR32::R2));
  FnmacS.addOperand(MCOperand::createReg(AVR32::R3));
  FnmacS.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FnmacS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst FmscS;
  FmscS.setOpcode(AVR32::FMSC_Srrrr);
  FmscS.addOperand(MCOperand::createReg(AVR32::R1));
  FmscS.addOperand(MCOperand::createReg(AVR32::R2));
  FmscS.addOperand(MCOperand::createReg(AVR32::R3));
  FmscS.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FmscS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst FnmscS;
  FnmscS.setOpcode(AVR32::FNMSC_Srrrr);
  FnmscS.addOperand(MCOperand::createReg(AVR32::R1));
  FnmscS.addOperand(MCOperand::createReg(AVR32::R2));
  FnmscS.addOperand(MCOperand::createReg(AVR32::R3));
  FnmscS.addOperand(MCOperand::createReg(AVR32::R4));

