cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FnmscS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst FcastuwS;
  FcastuwS.setOpcode(AVR32::FCASTUW_Srr);
  FcastuwS.addOperand(MCOperand::createReg(AVR32::R1));
  FcastuwS.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FcastuwS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa4);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst FcastswS;
  FcastswS.setOpcode(AVR32::FCASTSW_Srr);
  FcastswS.addOperand(MCOperand::createReg(AVR32::R1));
  FcastswS.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FcastswS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa6);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst FcastrsUW;
  FcastrsUW.setOpcode(AVR32::FCASTRS_UWrr);
  FcastrsUW.addOperand(MCOperand::createReg(AVR32::R1));
  FcastrsUW.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FcastrsUW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa9);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst FcastrsSW;
  FcastrsSW.setOpcode(AVR32::FCASTRS_SWrr);
  FcastrsSW.addOperand(MCOperand::createReg(AVR32::R1));
  FcastrsSW.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FcastrsSW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xab);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst FcmpS;
  FcmpS.setOpcode(AVR32::FCMP_Srr);
  FcmpS.addOperand(MCOperand::createReg(AVR32::R1));
  FcmpS.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FcmpS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xac);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x12);

  MCInst FchkS;
  FchkS.setOpcode(AVR32::FCHK_Sr);
  FchkS.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FchkS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xad);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst FrcpaS;
  FrcpaS.setOpcode(AVR32::FRCPA_Srr);
  FrcpaS.addOperand(MCOperand::createReg(AVR32::R1));
  FrcpaS.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FrcpaS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xae);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst FrsqrtaS;
  FrsqrtaS.setOpcode(AVR32::FRSQRTA_Srr);
  FrsqrtaS.addOperand(MCOperand::createReg(AVR32::R1));
  FrsqrtaS.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(FrsqrtaS, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst Incjosp;
  Incjosp.setOpcode(AVR32::INCJOSPi);
  Incjosp.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Incjosp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xd6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf3);

  MCInst Mcall;
  Mcall.setOpcode(AVR32::MCALL);
  Mcall.addOperand(MCOperand::createReg(AVR32::R1));
  Mcall.addOperand(MCOperand::createImm(-4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mcall, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdWPostInc;
  LdWPostInc.setOpcode(AVR32::LD_W_PostInc);
  LdWPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  LdWPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);

  MCInst LdWPreDec;
  LdWPreDec.setOpcode(AVR32::LD_W_PreDec);
  LdWPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  LdWPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x41);

  MCInst LdWDisp5;
  LdWDisp5.setOpcode(AVR32::LD_W_Disp5);
  LdWDisp5.addOperand(MCOperand::createReg(AVR32::R1));
  LdWDisp5.addOperand(MCOperand::createReg(AVR32::R2));
  LdWDisp5.addOperand(MCOperand::createImm(12));

