cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lddpc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x48);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst Lddsp;
  Lddsp.setOpcode(AVR32::LDDSP);
  Lddsp.addOperand(MCOperand::createReg(AVR32::R2));
  Lddsp.addOperand(MCOperand::createReg(AVR32::SP));
  Lddsp.addOperand(MCOperand::createImm(12));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lddsp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst LdinsB;
  LdinsB.setOpcode(AVR32::LDINS_B);
  LdinsB.addOperand(MCOperand::createReg(AVR32::R1));
  LdinsB.addOperand(MCOperand::createImm(2));
  LdinsB.addOperand(MCOperand::createReg(AVR32::R2));
  LdinsB.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdinsB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x6f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdinsH;
  LdinsH.setOpcode(AVR32::LDINS_H);
  LdinsH.addOperand(MCOperand::createReg(AVR32::R1));
  LdinsH.addOperand(MCOperand::createImm(1));
  LdinsH.addOperand(MCOperand::createReg(AVR32::R2));
  LdinsH.addOperand(MCOperand::createImm(-2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdinsH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x1f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdswpSHDisp12;
  LdswpSHDisp12.setOpcode(AVR32::LDSWP_SH_Disp12);
  LdswpSHDisp12.addOperand(MCOperand::createReg(AVR32::R1));
  LdswpSHDisp12.addOperand(MCOperand::createReg(AVR32::R2));
  LdswpSHDisp12.addOperand(MCOperand::createImm(-2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdswpSHDisp12, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x2f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdswpUHDisp12;
  LdswpUHDisp12.setOpcode(AVR32::LDSWP_UH_Disp12);
  LdswpUHDisp12.addOperand(MCOperand::createReg(AVR32::R1));
  LdswpUHDisp12.addOperand(MCOperand::createReg(AVR32::R2));
  LdswpUHDisp12.addOperand(MCOperand::createImm(-2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdswpUHDisp12, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x3f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdswpWDisp12;
  LdswpWDisp12.setOpcode(AVR32::LDSWP_W_Disp12);
  LdswpWDisp12.addOperand(MCOperand::createReg(AVR32::R1));
  LdswpWDisp12.addOperand(MCOperand::createReg(AVR32::R2));
  LdswpWDisp12.addOperand(MCOperand::createImm(-4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdswpWDisp12, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x8f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdSBDisp16;
  LdSBDisp16.setOpcode(AVR32::LD_SB_Disp16);
  LdSBDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdSBDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdSBDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSBDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdSBIndexShift;
  LdSBIndexShift.setOpcode(AVR32::LD_SB_IndexShift);
  LdSBIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdSBIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdSBIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdSBIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSBIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x06);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst LdSBEqDisp9;
  LdSBEqDisp9.setOpcode(AVR32::LD_SB_EQ_Disp9);
  LdSBEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdSBEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdSBEqDisp9.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSBEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x06);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdSBAlDisp9;
  LdSBAlDisp9.setOpcode(AVR32::LD_SB_AL_Disp9);
  LdSBAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdSBAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdSBAlDisp9.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSBAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xf6);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

