cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst LdUBPostInc;
  LdUBPostInc.setOpcode(AVR32::LD_UB_PostInc);
  LdUBPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst LdUBPreDec;
  LdUBPreDec.setOpcode(AVR32::LD_UB_PreDec);
  LdUBPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x71);

  MCInst LdUBDisp3;
  LdUBDisp3.setOpcode(AVR32::LD_UB_Disp3);
  LdUBDisp3.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBDisp3.addOperand(MCOperand::createReg(AVR32::R2));
  LdUBDisp3.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBDisp3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);

  MCInst LdUBDisp16;
  LdUBDisp16.setOpcode(AVR32::LD_UB_Disp16);
  LdUBDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdUBDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdUBIndexShift;
  LdUBIndexShift.setOpcode(AVR32::LD_UB_IndexShift);
  LdUBIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdUBIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdUBIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x07);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst LdUBEqDisp9;
  LdUBEqDisp9.setOpcode(AVR32::LD_UB_EQ_Disp9);
  LdUBEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdUBEqDisp9.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x08);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdUBAlDisp9;
  LdUBAlDisp9.setOpcode(AVR32::LD_UB_AL_Disp9);
  LdUBAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  LdUBAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));
  LdUBAlDisp9.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdUBAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xf8);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdSHPostInc;
  LdSHPostInc.setOpcode(AVR32::LD_SH_PostInc);
  LdSHPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);

  MCInst LdSHPreDec;
  LdSHPreDec.setOpcode(AVR32::LD_SH_PreDec);
  LdSHPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x05);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x51);

  MCInst LdSHDisp3;
  LdSHDisp3.setOpcode(AVR32::LD_SH_Disp3);
  LdSHDisp3.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHDisp3.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHDisp3.addOperand(MCOperand::createImm(6));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHDisp3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x84);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst LdSHDisp16;
  LdSHDisp16.setOpcode(AVR32::LD_SH_Disp16);
  LdSHDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHDisp16.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHDisp16.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdSHDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst LdSHIndexShift;
  LdSHIndexShift.setOpcode(AVR32::LD_SH_IndexShift);
  LdSHIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  LdSHIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdSHIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdSHIndexShift.addOperand(MCOperand::createImm(2));

