cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdmUpd, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst Ldmts;
  Ldmts.setOpcode(AVR32::LDMTS);
  Ldmts.addOperand(MCOperand::createReg(AVR32::R1));
  Ldmts.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ldmts, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst LdmtsUpd;
  LdmtsUpd.setOpcode(AVR32::LDMTS_UPD);
  LdmtsUpd.addOperand(MCOperand::createReg(AVR32::R1));
  LdmtsUpd.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdmtsUpd, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst LdcmD;
  LdcmD.setOpcode(AVR32::LDCM_D);
  LdcmD.addOperand(MCOperand::createImm(2));
  LdcmD.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmD.addOperand(MCOperand::createImm(0x03));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x44);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdcmDUpd;
  LdcmDUpd.setOpcode(AVR32::LDCM_D_UPD);
  LdcmDUpd.addOperand(MCOperand::createImm(2));
  LdcmDUpd.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmDUpd.addOperand(MCOperand::createImm(0x03));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmDUpd, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x54);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst LdcmWLow;
  LdcmWLow.setOpcode(AVR32::LDCM_W_Low);
  LdcmWLow.addOperand(MCOperand::createImm(2));
  LdcmWLow.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmWLow.addOperand(MCOperand::createImm(0x003c));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmWLow, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x3c);

  MCInst LdcmWLowUpd;
  LdcmWLowUpd.setOpcode(AVR32::LDCM_W_Low_UPD);
  LdcmWLowUpd.addOperand(MCOperand::createImm(2));
  LdcmWLowUpd.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmWLowUpd.addOperand(MCOperand::createImm(0x003c));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmWLowUpd, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x3c);

  MCInst LdcmWHigh;
  LdcmWHigh.setOpcode(AVR32::LDCM_W_High);
  LdcmWHigh.addOperand(MCOperand::createImm(2));
  LdcmWHigh.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmWHigh.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmWHigh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x41);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst LdcmWHighUpd;
  LdcmWHighUpd.setOpcode(AVR32::LDCM_W_High_UPD);
  LdcmWHighUpd.addOperand(MCOperand::createImm(2));
  LdcmWHighUpd.addOperand(MCOperand::createReg(AVR32::R2));
  LdcmWHighUpd.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcmWHighUpd, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x51);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst Stm;
  Stm.setOpcode(AVR32::STM);
  Stm.addOperand(MCOperand::createReg(AVR32::R1));
  Stm.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StmPre;
  StmPre.setOpcode(AVR32::STM_PRE);
  StmPre.addOperand(MCOperand::createReg(AVR32::R1));
  StmPre.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StmPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst Stmts;
  Stmts.setOpcode(AVR32::STMTS);
  Stmts.addOperand(MCOperand::createReg(AVR32::R1));
  Stmts.addOperand(MCOperand::createImm(0x400f));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stmts, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StmtsPre;
  StmtsPre.setOpcode(AVR32::STMTS_PRE);
  StmtsPre.addOperand(MCOperand::createReg(AVR32::R1));
  StmtsPre.addOperand(MCOperand::createImm(0x400f));

