cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StmtsPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xc1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StcmD;
  StcmD.setOpcode(AVR32::STCM_D);
  StcmD.addOperand(MCOperand::createImm(2));
  StcmD.addOperand(MCOperand::createReg(AVR32::R2));
  StcmD.addOperand(MCOperand::createImm(0x03));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x45);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StcmDPre;
  StcmDPre.setOpcode(AVR32::STCM_D_PRE);
  StcmDPre.addOperand(MCOperand::createImm(2));
  StcmDPre.addOperand(MCOperand::createReg(AVR32::R2));
  StcmDPre.addOperand(MCOperand::createImm(0x03));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmDPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x55);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StcmWLow;
  StcmWLow.setOpcode(AVR32::STCM_W_Low);
  StcmWLow.addOperand(MCOperand::createImm(2));
  StcmWLow.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWLow.addOperand(MCOperand::createImm(0x003c));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWLow, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x42);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x3c);

  MCInst StcmWLowPre;
  StcmWLowPre.setOpcode(AVR32::STCM_W_Low_PRE);
  StcmWLowPre.addOperand(MCOperand::createImm(2));
  StcmWLowPre.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWLowPre.addOperand(MCOperand::createImm(0x003c));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWLowPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x52);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x3c);

  MCInst StcmWHigh;
  StcmWHigh.setOpcode(AVR32::STCM_W_High);
  StcmWHigh.addOperand(MCOperand::createImm(2));
  StcmWHigh.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWHigh.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWHigh, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst StcmWHighPre;
  StcmWHighPre.setOpcode(AVR32::STCM_W_High_PRE);
  StcmWHighPre.addOperand(MCOperand::createImm(2));
  StcmWHighPre.addOperand(MCOperand::createReg(AVR32::R2));
  StcmWHighPre.addOperand(MCOperand::createImm(0x0f00));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcmWHighPre, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xed);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x53);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x0f);

  MCInst Lsl;
  Lsl.setOpcode(AVR32::LSLrrr);
  Lsl.addOperand(MCOperand::createReg(AVR32::R1));
  Lsl.addOperand(MCOperand::createReg(AVR32::R2));
  Lsl.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lsl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x09);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Lsr;
  Lsr.setOpcode(AVR32::LSRrrr);
  Lsr.addOperand(MCOperand::createReg(AVR32::R1));
  Lsr.addOperand(MCOperand::createReg(AVR32::R2));
  Lsr.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Lsr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Max;
  Max.setOpcode(AVR32::MAXrrr);
  Max.addOperand(MCOperand::createReg(AVR32::R1));
  Max.addOperand(MCOperand::createReg(AVR32::R2));
  Max.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Max, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Min;
  Min.setOpcode(AVR32::MINrrr);
  Min.addOperand(MCOperand::createReg(AVR32::R1));
  Min.addOperand(MCOperand::createReg(AVR32::R2));
  Min.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Min, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0d);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst Mfdr;
  Mfdr.setOpcode(AVR32::MFDRi);
  Mfdr.addOperand(MCOperand::createReg(AVR32::R1));
  Mfdr.addOperand(MCOperand::createImm(4));

