cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Orl, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe8);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Pref;
  Pref.setOpcode(AVR32::PREF);
  Pref.addOperand(MCOperand::createReg(AVR32::R1));
  Pref.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Pref, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x11);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst PabsSB;
  PabsSB.setOpcode(AVR32::PABS_SBrr);
  PabsSB.addOperand(MCOperand::createReg(AVR32::R1));
  PabsSB.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PabsSB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PabsSH;
  PabsSH.setOpcode(AVR32::PABS_SHrr);
  PabsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PabsSH.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PabsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xf1);

  MCInst PackshUB;
  PackshUB.setOpcode(AVR32::PACKSH_UBrrr);
  PackshUB.addOperand(MCOperand::createReg(AVR32::R1));
  PackshUB.addOperand(MCOperand::createReg(AVR32::R2));
  PackshUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PackshUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xc1);

  MCInst PackshSB;
  PackshSB.setOpcode(AVR32::PACKSH_SBrrr);
  PackshSB.addOperand(MCOperand::createReg(AVR32::R1));
  PackshSB.addOperand(MCOperand::createReg(AVR32::R2));
  PackshSB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PackshSB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd1);

  MCInst PackwSH;
  PackwSH.setOpcode(AVR32::PACKW_SHrrr);
  PackwSH.addOperand(MCOperand::createReg(AVR32::R1));
  PackwSH.addOperand(MCOperand::createReg(AVR32::R2));
  PackwSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PackwSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x71);

  MCInst PaddB;
  PaddB.setOpcode(AVR32::PADD_Brrr);
  PaddB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst PaddH;
  PaddH.setOpcode(AVR32::PADD_Hrrr);
  PaddH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst PaddhUB;
  PaddhUB.setOpcode(AVR32::PADDH_UBrrr);
  PaddhUB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddhUB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddhUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddhUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PaddhSH;
  PaddhSH.setOpcode(AVR32::PADDH_SHrrr);
  PaddhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xc1);

  MCInst PaddsUB;
  PaddsUB.setOpcode(AVR32::PADDS_UBrrr);
  PaddsUB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsUB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsUB.addOperand(MCOperand::createReg(AVR32::R3));

