cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst PaddsSB;
  PaddsSB.setOpcode(AVR32::PADDS_SBrrr);
  PaddsSB.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsSB.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsSB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsSB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddsUH;
  PaddsUH.setOpcode(AVR32::PADDS_UHrrr);
  PaddsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsUH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x81);

  MCInst PaddsSH;
  PaddsSH.setOpcode(AVR32::PADDS_SHrrr);
  PaddsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst PaddsubH;
  PaddsubH.setOpcode(AVR32::PADDSUB_H);
  PaddsubH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubH.addOperand(MCOperand::createImm(1));
  PaddsubH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddsubhSH;
  PaddsubhSH.setOpcode(AVR32::PADDSUBH_SH);
  PaddsubhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubhSH.addOperand(MCOperand::createImm(1));
  PaddsubhSH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubhSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PaddsubsUH;
  PaddsubsUH.setOpcode(AVR32::PADDSUBS_UH);
  PaddsubsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubsUH.addOperand(MCOperand::createImm(1));
  PaddsubsUH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubsUH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddsubsSH;
  PaddsubsSH.setOpcode(AVR32::PADDSUBS_SH);
  PaddsubsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddsubsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddsubsSH.addOperand(MCOperand::createImm(1));
  PaddsubsSH.addOperand(MCOperand::createReg(AVR32::R3));
  PaddsubsSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddsubsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PaddxH;
  PaddxH.setOpcode(AVR32::PADDX_Hrrr);
  PaddxH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PaddxhSH;
  PaddxhSH.setOpcode(AVR32::PADDXH_SHrrr);
  PaddxhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PaddxsUH;
  PaddxsUH.setOpcode(AVR32::PADDXS_UHrrr);
  PaddxsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxsUH.addOperand(MCOperand::createReg(AVR32::R3));

