cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PaddxsSH;
  PaddxsSH.setOpcode(AVR32::PADDXS_SHrrr);
  PaddxsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PaddxsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PaddxsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PaddxsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PasrB;
  PasrB.setOpcode(AVR32::PASR_Brri);
  PasrB.addOperand(MCOperand::createReg(AVR32::R1));
  PasrB.addOperand(MCOperand::createReg(AVR32::R2));
  PasrB.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PasrB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst PasrH;
  PasrH.setOpcode(AVR32::PASR_Hrri);
  PasrH.addOperand(MCOperand::createReg(AVR32::R1));
  PasrH.addOperand(MCOperand::createReg(AVR32::R2));
  PasrH.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PasrH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst PlslB;
  PlslB.setOpcode(AVR32::PLSL_Brri);
  PlslB.addOperand(MCOperand::createReg(AVR32::R1));
  PlslB.addOperand(MCOperand::createReg(AVR32::R2));
  PlslB.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlslB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x21);

  MCInst PlslH;
  PlslH.setOpcode(AVR32::PLSL_Hrri);
  PlslH.addOperand(MCOperand::createReg(AVR32::R1));
  PlslH.addOperand(MCOperand::createReg(AVR32::R2));
  PlslH.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlslH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x51);

  MCInst PlsrB;
  PlsrB.setOpcode(AVR32::PLSR_Brri);
  PlsrB.addOperand(MCOperand::createReg(AVR32::R1));
  PlsrB.addOperand(MCOperand::createReg(AVR32::R2));
  PlsrB.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlsrB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst PlsrH;
  PlsrH.setOpcode(AVR32::PLSR_Hrri);
  PlsrH.addOperand(MCOperand::createReg(AVR32::R1));
  PlsrH.addOperand(MCOperand::createReg(AVR32::R2));
  PlsrH.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PlsrH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x0f);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PavgUB;
  PavgUB.setOpcode(AVR32::PAVG_UBrrr);
  PavgUB.addOperand(MCOperand::createReg(AVR32::R1));
  PavgUB.addOperand(MCOperand::createReg(AVR32::R2));
  PavgUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PavgUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xc1);

  MCInst PavgSH;
  PavgSH.setOpcode(AVR32::PAVG_SHrrr);
  PavgSH.addOperand(MCOperand::createReg(AVR32::R1));
  PavgSH.addOperand(MCOperand::createReg(AVR32::R2));
  PavgSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PavgSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd1);

  MCInst PmaxUB;
  PmaxUB.setOpcode(AVR32::PMAX_UBrrr);
  PmaxUB.addOperand(MCOperand::createReg(AVR32::R1));
  PmaxUB.addOperand(MCOperand::createReg(AVR32::R2));
  PmaxUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PmaxUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x81);

  MCInst PmaxSH;
  PmaxSH.setOpcode(AVR32::PMAX_SHrrr);
  PmaxSH.addOperand(MCOperand::createReg(AVR32::R1));
  PmaxSH.addOperand(MCOperand::createReg(AVR32::R2));
  PmaxSH.addOperand(MCOperand::createReg(AVR32::R3));

