cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PmaxSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x91);

  MCInst PminUB;
  PminUB.setOpcode(AVR32::PMIN_UBrrr);
  PminUB.addOperand(MCOperand::createReg(AVR32::R1));
  PminUB.addOperand(MCOperand::createReg(AVR32::R2));
  PminUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PminUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa1);

  MCInst PminSH;
  PminSH.setOpcode(AVR32::PMIN_SHrrr);
  PminSH.addOperand(MCOperand::createReg(AVR32::R1));
  PminSH.addOperand(MCOperand::createReg(AVR32::R2));
  PminSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PminSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xb1);

  MCInst Psad;
  Psad.setOpcode(AVR32::PSADrrr);
  Psad.addOperand(MCOperand::createReg(AVR32::R1));
  Psad.addOperand(MCOperand::createReg(AVR32::R2));
  Psad.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Psad, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst PsubB;
  PsubB.setOpcode(AVR32::PSUB_Brrr);
  PsubB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst PsubH;
  PsubH.setOpcode(AVR32::PSUB_Hrrr);
  PsubH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x11);

  MCInst PsubaddH;
  PsubaddH.setOpcode(AVR32::PSUBADD_H);
  PsubaddH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddH.addOperand(MCOperand::createImm(1));
  PsubaddH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PsubaddhSH;
  PsubaddhSH.setOpcode(AVR32::PSUBADDH_SH);
  PsubaddhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddhSH.addOperand(MCOperand::createImm(1));
  PsubaddhSH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddhSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PsubaddsUH;
  PsubaddsUH.setOpcode(AVR32::PSUBADDS_UH);
  PsubaddsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddsUH.addOperand(MCOperand::createImm(1));
  PsubaddsUH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddsUH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x22);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x61);

  MCInst PsubaddsSH;
  PsubaddsSH.setOpcode(AVR32::PSUBADDS_SH);
  PsubaddsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubaddsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubaddsSH.addOperand(MCOperand::createImm(1));
  PsubaddsSH.addOperand(MCOperand::createReg(AVR32::R3));
  PsubaddsSH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubaddsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x21);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe1);

  MCInst PsubhUB;
  PsubhUB.setOpcode(AVR32::PSUBH_UBrrr);
  PsubhUB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubhUB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubhUB.addOperand(MCOperand::createReg(AVR32::R3));

