cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubhUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x71);

  MCInst PsubhSH;
  PsubhSH.setOpcode(AVR32::PSUBH_SHrrr);
  PsubhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd1);

  MCInst PsubsUB;
  PsubsUB.setOpcode(AVR32::PSUBS_UBrrr);
  PsubsUB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsUB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsUB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsUB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x51);

  MCInst PsubsSB;
  PsubsSB.setOpcode(AVR32::PSUBS_SBrrr);
  PsubsSB.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsSB.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsSB.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsSB, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x23);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst PsubsUH;
  PsubsUH.setOpcode(AVR32::PSUBS_UHrrr);
  PsubsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsUH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x91);

  MCInst PsubsSH;
  PsubsSH.setOpcode(AVR32::PSUBS_SHrrr);
  PsubsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x51);

  MCInst PsubxH;
  PsubxH.setOpcode(AVR32::PSUBX_Hrrr);
  PsubxH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubxH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubxH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubxH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst PsubxhSH;
  PsubxhSH.setOpcode(AVR32::PSUBXH_SHrrr);
  PsubxhSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubxhSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubxhSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubxhSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xf1);

  MCInst PsubxsUH;
  PsubxsUH.setOpcode(AVR32::PSUBXS_UHrrr);
  PsubxsUH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubxsUH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubxsUH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubxsUH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xb1);

  MCInst PsubxsSH;
  PsubxsSH.setOpcode(AVR32::PSUBXS_SHrrr);
  PsubxsSH.addOperand(MCOperand::createReg(AVR32::R1));
  PsubxsSH.addOperand(MCOperand::createReg(AVR32::R2));
  PsubxsSH.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PsubxsSH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x71);

  MCInst PunpckubH;
  PunpckubH.setOpcode(AVR32::PUNPCKUB_H);
  PunpckubH.addOperand(MCOperand::createReg(AVR32::R1));
  PunpckubH.addOperand(MCOperand::createReg(AVR32::R2));
  PunpckubH.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PunpckubH, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x24);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x81);

  MCInst PunpcksbH;
  PunpcksbH.setOpcode(AVR32::PUNPCKSB_H);
  PunpcksbH.addOperand(MCOperand::createReg(AVR32::R1));
  PunpcksbH.addOperand(MCOperand::createReg(AVR32::R2));
  PunpcksbH.addOperand(MCOperand::createImm(1));

