cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StDReg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x13);

  MCInst StDDisp16;
  StDDisp16.setOpcode(AVR32::ST_D_Disp16);
  StDDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  StDDisp16.addOperand(MCOperand::createImm(-1));
  StDDisp16.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StDDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst StDIndexShift;
  StDIndexShift.setOpcode(AVR32::ST_D_IndexShift);
  StDIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  StDIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StDIndexShift.addOperand(MCOperand::createImm(3));
  StDIndexShift.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x08);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst StHPostInc;
  StHPostInc.setOpcode(AVR32::ST_H_PostInc);
  StHPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  StHPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb2);

  MCInst StHPreDec;
  StHPreDec.setOpcode(AVR32::ST_H_PreDec);
  StHPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  StHPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe2);

  MCInst StHDisp3;
  StHDisp3.setOpcode(AVR32::ST_H_Disp3);
  StHDisp3.addOperand(MCOperand::createReg(AVR32::R1));
  StHDisp3.addOperand(MCOperand::createImm(6));
  StHDisp3.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHDisp3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst StHDisp16;
  StHDisp16.setOpcode(AVR32::ST_H_Disp16);
  StHDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  StHDisp16.addOperand(MCOperand::createImm(-1));
  StHDisp16.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x52);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst StHIndexShift;
  StHIndexShift.setOpcode(AVR32::ST_H_IndexShift);
  StHIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  StHIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StHIndexShift.addOperand(MCOperand::createImm(3));
  StHIndexShift.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst StHEqDisp9;
  StHEqDisp9.setOpcode(AVR32::ST_H_EQ_Disp9);
  StHEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StHEqDisp9.addOperand(MCOperand::createImm(6));
  StHEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StHAlDisp9;
  StHAlDisp9.setOpcode(AVR32::ST_H_AL_Disp9);
  StHAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StHAlDisp9.addOperand(MCOperand::createImm(6));
  StHAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StHAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xfc);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StWPostInc;
  StWPostInc.setOpcode(AVR32::ST_W_PostInc);
  StWPostInc.addOperand(MCOperand::createReg(AVR32::R1));
  StWPostInc.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);

  MCInst StWPreDec;
  StWPreDec.setOpcode(AVR32::ST_W_PreDec);
  StWPreDec.addOperand(MCOperand::createReg(AVR32::R1));
  StWPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);

  MCInst StWDisp4;
  StWDisp4.setOpcode(AVR32::ST_W_Disp4);
  StWDisp4.addOperand(MCOperand::createReg(AVR32::R1));
  StWDisp4.addOperand(MCOperand::createImm(12));
  StWDisp4.addOperand(MCOperand::createReg(AVR32::R2));

