cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWDisp4, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x83);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst StWDisp16;
  StWDisp16.setOpcode(AVR32::ST_W_Disp16);
  StWDisp16.addOperand(MCOperand::createReg(AVR32::R1));
  StWDisp16.addOperand(MCOperand::createImm(-1));
  StWDisp16.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWDisp16, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x42);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst StWIndexShift;
  StWIndexShift.setOpcode(AVR32::ST_W_IndexShift);
  StWIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  StWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StWIndexShift.addOperand(MCOperand::createImm(3));
  StWIndexShift.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe2);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x09);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x34);

  MCInst StWEqDisp9;
  StWEqDisp9.setOpcode(AVR32::ST_W_EQ_Disp9);
  StWEqDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StWEqDisp9.addOperand(MCOperand::createImm(12));
  StWEqDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWEqDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0a);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst StWAlDisp9;
  StWAlDisp9.setOpcode(AVR32::ST_W_AL_Disp9);
  StWAlDisp9.addOperand(MCOperand::createReg(AVR32::R1));
  StWAlDisp9.addOperand(MCOperand::createImm(12));
  StWAlDisp9.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StWAlDisp9, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xf2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xfa);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x03);

  MCInst Stcond;
  Stcond.setOpcode(AVR32::STCOND);
  Stcond.addOperand(MCOperand::createReg(AVR32::R1));
  Stcond.addOperand(MCOperand::createImm(-1));
  Stcond.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stcond, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x72);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xff);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst Stdsp;
  Stdsp.setOpcode(AVR32::STDSP);
  Stdsp.addOperand(MCOperand::createReg(AVR32::SP));
  Stdsp.addOperand(MCOperand::createImm(12));
  Stdsp.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stdsp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x32);

  MCInst SthhWDisp8;
  SthhWDisp8.setOpcode(AVR32::STHH_W_Disp8);
  SthhWDisp8.addOperand(MCOperand::createReg(AVR32::R1));
  SthhWDisp8.addOperand(MCOperand::createImm(12));
  SthhWDisp8.addOperand(MCOperand::createReg(AVR32::R2));
  SthhWDisp8.addOperand(MCOperand::createImm(1));
  SthhWDisp8.addOperand(MCOperand::createReg(AVR32::R3));
  SthhWDisp8.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SthhWDisp8, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xe0);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst SthhWIndexShift;
  SthhWIndexShift.setOpcode(AVR32::STHH_W_IndexShift);
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R1));
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R4));
  SthhWIndexShift.addOperand(MCOperand::createImm(3));
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  SthhWIndexShift.addOperand(MCOperand::createImm(1));
  SthhWIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  SthhWIndexShift.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(SthhWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0xa4);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x31);

  MCInst StswpHDisp12;
  StswpHDisp12.setOpcode(AVR32::STSWP_H_Disp12);
  StswpHDisp12.addOperand(MCOperand::createReg(AVR32::R1));
  StswpHDisp12.addOperand(MCOperand::createImm(-2));
  StswpHDisp12.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StswpHDisp12, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xd2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x9f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst SubhhW;
  SubhhW.setOpcode(AVR32::SUBHH_W);
  SubhhW.addOperand(MCOperand::createReg(AVR32::R1));
  SubhhW.addOperand(MCOperand::createReg(AVR32::R2));
  SubhhW.addOperand(MCOperand::createImm(1));
  SubhhW.addOperand(MCOperand::createReg(AVR32::R3));
  SubhhW.addOperand(MCOperand::createImm(0));

