cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  MCInst Picosvmul3;
  Picosvmul3.setOpcode(AVR32::PICOSVMUL3);
  Picosvmul3.addOperand(MCOperand::createImm(9));
  Picosvmul3.addOperand(MCOperand::createImm(10));
  Picosvmul3.addOperand(MCOperand::createImm(11));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Picosvmul3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xab);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x29);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xab);

  MCInst Picosvmac3;
  Picosvmac3.setOpcode(AVR32::PICOSVMAC3);
  Picosvmac3.addOperand(MCOperand::createImm(9));
  Picosvmac3.addOperand(MCOperand::createImm(10));
  Picosvmac3.addOperand(MCOperand::createImm(11));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Picosvmac3, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x29);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xab);

  MCInst MvcrD;
  MvcrD.setOpcode(AVR32::MVCRd);
  MvcrD.addOperand(MCOperand::createReg(AVR32::R0));
  MvcrD.addOperand(MCOperand::createImm(2));
  MvcrD.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvcrD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa0);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x42);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x10);

  MCInst MvcrW;
  MvcrW.setOpcode(AVR32::MVCRw);
  MvcrW.addOperand(MCOperand::createReg(AVR32::R1));
  MvcrW.addOperand(MCOperand::createImm(2));
  MvcrW.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvcrW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst PicomvDFromReg;
  PicomvDFromReg.setOpcode(AVR32::PICOMV_D_FromReg);
  PicomvDFromReg.addOperand(MCOperand::createImm(14));
  PicomvDFromReg.addOperand(MCOperand::createReg(AVR32::LR));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicomvDFromReg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xae);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x2e);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x30);

  MCInst PicomvDToReg;
  PicomvDToReg.setOpcode(AVR32::PICOMV_D_ToReg);
  PicomvDToReg.addOperand(MCOperand::createReg(AVR32::LR));
  PicomvDToReg.addOperand(MCOperand::createImm(14));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicomvDToReg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xae);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x2e);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x10);

  MCInst PicomvWFromReg;
  PicomvWFromReg.setOpcode(AVR32::PICOMV_W_FromReg);
  PicomvWFromReg.addOperand(MCOperand::createImm(15));
  PicomvWFromReg.addOperand(MCOperand::createReg(AVR32::PC));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicomvWFromReg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x2f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x20);

  MCInst PicomvWToReg;
  PicomvWToReg.setOpcode(AVR32::PICOMV_W_ToReg);
  PicomvWToReg.addOperand(MCOperand::createReg(AVR32::R0));
  PicomvWToReg.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicomvWToReg, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa0);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x20);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst MvrcD;
  MvrcD.setOpcode(AVR32::MVRCd);
  MvrcD.addOperand(MCOperand::createImm(2));
  MvrcD.addOperand(MCOperand::createImm(0));
  MvrcD.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvrcD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x30);

  MCInst MvrcW;
  MvrcW.setOpcode(AVR32::MVRCw);
  MvrcW.addOperand(MCOperand::createImm(2));
  MvrcW.addOperand(MCOperand::createImm(3));
  MvrcW.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MvrcW, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x20);

  MCInst LdcDDisp;
  LdcDDisp.setOpcode(AVR32::LDC_D_Disp);
  LdcDDisp.addOperand(MCOperand::createImm(2));
  LdcDDisp.addOperand(MCOperand::createImm(0));
  LdcDDisp.addOperand(MCOperand::createReg(AVR32::R2));
  LdcDDisp.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcDDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst LdcDPreDec;
  LdcDPreDec.setOpcode(AVR32::LDC_D_PreDec);
  LdcDPreDec.addOperand(MCOperand::createImm(2));
  LdcDPreDec.addOperand(MCOperand::createImm(0));
  LdcDPreDec.addOperand(MCOperand::createReg(AVR32::R2));

