cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcDPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x50);

  MCInst LdcDIndexShift;
  LdcDIndexShift.setOpcode(AVR32::LDC_D_IndexShift);
  LdcDIndexShift.addOperand(MCOperand::createImm(2));
  LdcDIndexShift.addOperand(MCOperand::createImm(0));
  LdcDIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdcDIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdcDIndexShift.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x53);

  MCInst LdcWDisp;
  LdcWDisp.setOpcode(AVR32::LDC_W_Disp);
  LdcWDisp.addOperand(MCOperand::createImm(2));
  LdcWDisp.addOperand(MCOperand::createImm(3));
  LdcWDisp.addOperand(MCOperand::createReg(AVR32::R2));
  LdcWDisp.addOperand(MCOperand::createImm(4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcWDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst LdcWPreDec;
  LdcWPreDec.setOpcode(AVR32::LDC_W_PreDec);
  LdcWPreDec.addOperand(MCOperand::createImm(2));
  LdcWPreDec.addOperand(MCOperand::createImm(3));
  LdcWPreDec.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x40);

  MCInst LdcWIndexShift;
  LdcWIndexShift.setOpcode(AVR32::LDC_W_IndexShift);
  LdcWIndexShift.addOperand(MCOperand::createImm(2));
  LdcWIndexShift.addOperand(MCOperand::createImm(3));
  LdcWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  LdcWIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  LdcWIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(LdcWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x53);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x23);

  MCInst PicoldDDisp;
  PicoldDDisp.setOpcode(AVR32::PICOLD_D_Disp);
  PicoldDDisp.addOperand(MCOperand::createImm(14));
  PicoldDDisp.addOperand(MCOperand::createReg(AVR32::PC));
  PicoldDDisp.addOperand(MCOperand::createImm(1020));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicoldDDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x3e);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst PicoldDPreDec;
  PicoldDPreDec.setOpcode(AVR32::PICOLD_D_PreDec);
  PicoldDPreDec.addOperand(MCOperand::createImm(6));
  PicoldDPreDec.addOperand(MCOperand::createReg(AVR32::R8));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicoldDPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa8);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x26);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x50);

  MCInst PicoldDIndexShift;
  PicoldDIndexShift.setOpcode(AVR32::PICOLD_D_IndexShift);
  PicoldDIndexShift.addOperand(MCOperand::createImm(2));
  PicoldDIndexShift.addOperand(MCOperand::createReg(AVR32::R10));
  PicoldDIndexShift.addOperand(MCOperand::createReg(AVR32::R5));
  PicoldDIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicoldDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaa);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x32);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x65);

  MCInst PicoldWDisp;
  PicoldWDisp.setOpcode(AVR32::PICOLD_W_Disp);
  PicoldWDisp.addOperand(MCOperand::createImm(15));
  PicoldWDisp.addOperand(MCOperand::createReg(AVR32::PC));
  PicoldWDisp.addOperand(MCOperand::createImm(1020));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicoldWDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe9);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x2f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst PicoldWPreDec;
  PicoldWPreDec.setOpcode(AVR32::PICOLD_W_PreDec);
  PicoldWPreDec.addOperand(MCOperand::createImm(7));
  PicoldWPreDec.addOperand(MCOperand::createReg(AVR32::R8));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicoldWPreDec, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa8);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x27);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x40);

  MCInst PicoldWIndexShift;
  PicoldWIndexShift.setOpcode(AVR32::PICOLD_W_IndexShift);
  PicoldWIndexShift.addOperand(MCOperand::createImm(1));
  PicoldWIndexShift.addOperand(MCOperand::createReg(AVR32::R10));
  PicoldWIndexShift.addOperand(MCOperand::createReg(AVR32::R5));
  PicoldWIndexShift.addOperand(MCOperand::createImm(2));

