cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicoldWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaa);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x31);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x25);

  MCInst Ldc0DDisp;
  Ldc0DDisp.setOpcode(AVR32::LDC0_D_Disp);
  Ldc0DDisp.addOperand(MCOperand::createImm(0));
  Ldc0DDisp.addOperand(MCOperand::createReg(AVR32::R2));
  Ldc0DDisp.addOperand(MCOperand::createImm(4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ldc0DDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Ldc0WDisp;
  Ldc0WDisp.setOpcode(AVR32::LDC0_W_Disp);
  Ldc0WDisp.addOperand(MCOperand::createImm(3));
  Ldc0WDisp.addOperand(MCOperand::createReg(AVR32::R2));
  Ldc0WDisp.addOperand(MCOperand::createImm(8));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Ldc0WDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst StcDDisp;
  StcDDisp.setOpcode(AVR32::STC_D_Disp);
  StcDDisp.addOperand(MCOperand::createImm(2));
  StcDDisp.addOperand(MCOperand::createReg(AVR32::R2));
  StcDDisp.addOperand(MCOperand::createImm(0));
  StcDDisp.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcDDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x00);

  MCInst StcDPostInc;
  StcDPostInc.setOpcode(AVR32::STC_D_PostInc);
  StcDPostInc.addOperand(MCOperand::createImm(2));
  StcDPostInc.addOperand(MCOperand::createReg(AVR32::R2));
  StcDPostInc.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcDPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x40);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x70);

  MCInst StcDIndexShift;
  StcDIndexShift.setOpcode(AVR32::STC_D_IndexShift);
  StcDIndexShift.addOperand(MCOperand::createImm(2));
  StcDIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StcDIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  StcDIndexShift.addOperand(MCOperand::createImm(1));
  StcDIndexShift.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x50);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xd3);

  MCInst StcWDisp;
  StcWDisp.setOpcode(AVR32::STC_W_Disp);
  StcWDisp.addOperand(MCOperand::createImm(2));
  StcWDisp.addOperand(MCOperand::createReg(AVR32::R2));
  StcWDisp.addOperand(MCOperand::createImm(4));
  StcWDisp.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcWDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst StcWPostInc;
  StcWPostInc.setOpcode(AVR32::STC_W_PostInc);
  StcWPostInc.addOperand(MCOperand::createImm(2));
  StcWPostInc.addOperand(MCOperand::createReg(AVR32::R2));
  StcWPostInc.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcWPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x43);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x60);

  MCInst StcWIndexShift;
  StcWIndexShift.setOpcode(AVR32::STC_W_IndexShift);
  StcWIndexShift.addOperand(MCOperand::createImm(2));
  StcWIndexShift.addOperand(MCOperand::createReg(AVR32::R2));
  StcWIndexShift.addOperand(MCOperand::createReg(AVR32::R3));
  StcWIndexShift.addOperand(MCOperand::createImm(2));
  StcWIndexShift.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(StcWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x53);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa3);

  MCInst PicostDDisp;
  PicostDDisp.setOpcode(AVR32::PICOST_D_Disp);
  PicostDDisp.addOperand(MCOperand::createReg(AVR32::PC));
  PicostDDisp.addOperand(MCOperand::createImm(1020));
  PicostDDisp.addOperand(MCOperand::createImm(14));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicostDDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x3e);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst PicostDPostInc;
  PicostDPostInc.setOpcode(AVR32::PICOST_D_PostInc);
  PicostDPostInc.addOperand(MCOperand::createReg(AVR32::R8));
  PicostDPostInc.addOperand(MCOperand::createImm(6));

