cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicostDPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa8);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x26);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x70);

  MCInst PicostDIndexShift;
  PicostDIndexShift.setOpcode(AVR32::PICOST_D_IndexShift);
  PicostDIndexShift.addOperand(MCOperand::createReg(AVR32::R10));
  PicostDIndexShift.addOperand(MCOperand::createReg(AVR32::R5));
  PicostDIndexShift.addOperand(MCOperand::createImm(2));
  PicostDIndexShift.addOperand(MCOperand::createImm(2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicostDIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaa);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x32);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xe5);

  MCInst PicostWDisp;
  PicostWDisp.setOpcode(AVR32::PICOST_W_Disp);
  PicostWDisp.addOperand(MCOperand::createReg(AVR32::PC));
  PicostWDisp.addOperand(MCOperand::createImm(1020));
  PicostWDisp.addOperand(MCOperand::createImm(15));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicostWDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xeb);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaf);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x2f);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst PicostWPostInc;
  PicostWPostInc.setOpcode(AVR32::PICOST_W_PostInc);
  PicostWPostInc.addOperand(MCOperand::createReg(AVR32::R8));
  PicostWPostInc.addOperand(MCOperand::createImm(7));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicostWPostInc, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa8);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x27);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x60);

  MCInst PicostWIndexShift;
  PicostWIndexShift.setOpcode(AVR32::PICOST_W_IndexShift);
  PicostWIndexShift.addOperand(MCOperand::createReg(AVR32::R10));
  PicostWIndexShift.addOperand(MCOperand::createReg(AVR32::R5));
  PicostWIndexShift.addOperand(MCOperand::createImm(2));
  PicostWIndexShift.addOperand(MCOperand::createImm(1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(PicostWIndexShift, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xef);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xaa);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x31);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xa5);

  MCInst Stc0DDisp;
  Stc0DDisp.setOpcode(AVR32::STC0_D_Disp);
  Stc0DDisp.addOperand(MCOperand::createReg(AVR32::R2));
  Stc0DDisp.addOperand(MCOperand::createImm(4));
  Stc0DDisp.addOperand(MCOperand::createImm(0));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stc0DDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Stc0WDisp;
  Stc0WDisp.setOpcode(AVR32::STC0_W_Disp);
  Stc0WDisp.addOperand(MCOperand::createReg(AVR32::R2));
  Stc0WDisp.addOperand(MCOperand::createImm(8));
  Stc0WDisp.addOperand(MCOperand::createImm(3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Stc0WDisp, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xf5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xa2);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  std::unique_ptr<MCInstPrinter> InstPrinter(
      TheTarget->createMCInstPrinter(TT, /*SyntaxVariant=*/0, *MAI, *MII,
                                     *MRI));
  ASSERT_NE(InstPrinter.get(), nullptr);

  std::string Printed;
  raw_string_ostream OS(Printed);
  InstPrinter->printInst(&Nop, /*Address=*/0, /*Annot=*/"", *STI, OS);
  OS.flush();
  EXPECT_EQ(Printed, "\tnop");

  Printed.clear();
  raw_string_ostream AbsOS(Printed);
  InstPrinter->printInst(&Abs, /*Address=*/0, /*Annot=*/"", *STI, AbsOS);
  AbsOS.flush();
  EXPECT_EQ(Printed, "\tabs\tr1");

  Printed.clear();
  raw_string_ostream AcrOS(Printed);
  InstPrinter->printInst(&Acr, /*Address=*/0, /*Annot=*/"", *STI, AcrOS);
  AcrOS.flush();
  EXPECT_EQ(Printed, "\tacr\tr1");

  Printed.clear();
  raw_string_ostream ACallOS(Printed);
  InstPrinter->printInst(&ACall, /*Address=*/0, /*Annot=*/"", *STI, ACallOS);
  ACallOS.flush();
  EXPECT_EQ(Printed, "\tacall\t4");

  Printed.clear();
  raw_string_ostream AdcOS(Printed);
  InstPrinter->printInst(&Adc, /*Address=*/0, /*Annot=*/"", *STI, AdcOS);
  AdcOS.flush();
  EXPECT_EQ(Printed, "\tadc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddAbsOS(Printed);
  InstPrinter->printInst(&AddAbs, /*Address=*/0, /*Annot=*/"", *STI,
                         AddAbsOS);
  AddAbsOS.flush();
  EXPECT_EQ(Printed, "\taddabs\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AddhhWOS(Printed);
  InstPrinter->printInst(&AddhhW, /*Address=*/0, /*Annot=*/"", *STI,
                         AddhhWOS);
  AddhhWOS.flush();
  EXPECT_EQ(Printed, "\taddhh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream AddOS(Printed);
  InstPrinter->printInst(&Add, /*Address=*/0, /*Annot=*/"", *STI, AddOS);
  AddOS.flush();
  EXPECT_EQ(Printed, "\tadd\tr1, r2");

  Printed.clear();
  raw_string_ostream AddEqOS(Printed);
  InstPrinter->printInst(&AddEq, /*Address=*/0, /*Annot=*/"", *STI, AddEqOS);
  AddEqOS.flush();
  EXPECT_EQ(Printed, "\taddeq\tr1, r2, r3");

