cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream CpBOS(Printed);
  InstPrinter->printInst(&CpB, /*Address=*/0, /*Annot=*/"", *STI, CpBOS);
  CpBOS.flush();
  EXPECT_EQ(Printed, "\tcp.b\tr1, r2");

  Printed.clear();
  raw_string_ostream CpHOS(Printed);
  InstPrinter->printInst(&CpH, /*Address=*/0, /*Annot=*/"", *STI, CpHOS);
  CpHOS.flush();
  EXPECT_EQ(Printed, "\tcp.h\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWOS(Printed);
  InstPrinter->printInst(&CpW, /*Address=*/0, /*Annot=*/"", *STI, CpWOS);
  CpWOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWImmOS(Printed);
  InstPrinter->printInst(&CpWImm, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImmOS);
  CpWImmOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, -1");

  Printed.clear();
  raw_string_ostream CpWImm21OS(Printed);
  InstPrinter->printInst(&CpWImm21, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImm21OS);
  CpWImm21OS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, 32");

  Printed.clear();
  raw_string_ostream CpOS(Printed);
  InstPrinter->printInst(&Cp, /*Address=*/0, /*Annot=*/"", *STI, CpOS);
  CpOS.flush();
  EXPECT_EQ(Printed, "\tcp\tr1, r2");

  Printed.clear();
  raw_string_ostream CpImmOS(Printed);
  InstPrinter->printInst(&CpImm, /*Address=*/0, /*Annot=*/"", *STI,
                         CpImmOS);
  CpImmOS.flush();
  EXPECT_EQ(Printed, "\tcp\tr1, -1");

  Printed.clear();
  raw_string_ostream CpImm21OS(Printed);
  InstPrinter->printInst(&CpImm21, /*Address=*/0, /*Annot=*/"", *STI,
                         CpImm21OS);
  CpImm21OS.flush();
  EXPECT_EQ(Printed, "\tcp\tr1, 32");

  Printed.clear();
  raw_string_ostream CsrfczOS(Printed);
  InstPrinter->printInst(&Csrfcz, /*Address=*/0, /*Annot=*/"", *STI,
                         CsrfczOS);
  CsrfczOS.flush();
  EXPECT_EQ(Printed, "\tcsrfcz\t1");

  Printed.clear();
  raw_string_ostream CsrfOS(Printed);
  InstPrinter->printInst(&Csrf, /*Address=*/0, /*Annot=*/"", *STI, CsrfOS);
  CsrfOS.flush();
  EXPECT_EQ(Printed, "\tcsrf\t1");

  Printed.clear();
  raw_string_ostream NegOS(Printed);
  InstPrinter->printInst(&Neg, /*Address=*/0, /*Annot=*/"", *STI, NegOS);
  NegOS.flush();
  EXPECT_EQ(Printed, "\tneg\tr1");

  Printed.clear();
  raw_string_ostream EorOS(Printed);
  InstPrinter->printInst(&Eor, /*Address=*/0, /*Annot=*/"", *STI, EorOS);
  EorOS.flush();
  EXPECT_EQ(Printed, "\teor\tr1, r2");

  Printed.clear();
  raw_string_ostream EorhOS(Printed);
  InstPrinter->printInst(&Eorh, /*Address=*/0, /*Annot=*/"", *STI, EorhOS);
  EorhOS.flush();
  EXPECT_EQ(Printed, "\teorh\tr1, 1");

  Printed.clear();
  raw_string_ostream EorlOS(Printed);
  InstPrinter->printInst(&Eorl, /*Address=*/0, /*Annot=*/"", *STI, EorlOS);
  EorlOS.flush();
  EXPECT_EQ(Printed, "\teorl\tr1, 1");

  Printed.clear();
  raw_string_ostream EorEqOS(Printed);
  InstPrinter->printInst(&EorEq, /*Address=*/0, /*Annot=*/"", *STI, EorEqOS);
  EorEqOS.flush();
  EXPECT_EQ(Printed, "\teoreq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream EorAlOS(Printed);
  InstPrinter->printInst(&EorAl, /*Address=*/0, /*Annot=*/"", *STI, EorAlOS);
  EorAlOS.flush();
  EXPECT_EQ(Printed, "\teoral\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FrsOS(Printed);
  InstPrinter->printInst(&Frs, /*Address=*/0, /*Annot=*/"", *STI, FrsOS);
  FrsOS.flush();
  EXPECT_EQ(Printed, "\tfrs");

  Printed.clear();
  raw_string_ostream FaddSOS(Printed);
  InstPrinter->printInst(&FaddS, /*Address=*/0, /*Annot=*/"", *STI, FaddSOS);
  FaddSOS.flush();
  EXPECT_EQ(Printed, "\tfadd.s\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FsubSOS(Printed);
  InstPrinter->printInst(&FsubS, /*Address=*/0, /*Annot=*/"", *STI, FsubSOS);
  FsubSOS.flush();
  EXPECT_EQ(Printed, "\tfsub.s\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FmulSOS(Printed);
  InstPrinter->printInst(&FmulS, /*Address=*/0, /*Annot=*/"", *STI, FmulSOS);
  FmulSOS.flush();
  EXPECT_EQ(Printed, "\tfmul.s\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FnmulSOS(Printed);
  InstPrinter->printInst(&FnmulS, /*Address=*/0, /*Annot=*/"", *STI,
                         FnmulSOS);
  FnmulSOS.flush();
  EXPECT_EQ(Printed, "\tfnmul.s\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FmacSOS(Printed);
  InstPrinter->printInst(&FmacS, /*Address=*/0, /*Annot=*/"", *STI, FmacSOS);
  FmacSOS.flush();
  EXPECT_EQ(Printed, "\tfmac.s\tr1, r2, r3, r4");

  Printed.clear();
  raw_string_ostream FnmacSOS(Printed);
  InstPrinter->printInst(&FnmacS, /*Address=*/0, /*Annot=*/"", *STI,
                         FnmacSOS);
  FnmacSOS.flush();
  EXPECT_EQ(Printed, "\tfnmac.s\tr1, r2, r3, r4");

  Printed.clear();
  raw_string_ostream FmscSOS(Printed);
  InstPrinter->printInst(&FmscS, /*Address=*/0, /*Annot=*/"", *STI, FmscSOS);
  FmscSOS.flush();
  EXPECT_EQ(Printed, "\tfmsc.s\tr1, r2, r3, r4");

  Printed.clear();
  raw_string_ostream FnmscSOS(Printed);
  InstPrinter->printInst(&FnmscS, /*Address=*/0, /*Annot=*/"", *STI,
                         FnmscSOS);
  FnmscSOS.flush();
  EXPECT_EQ(Printed, "\tfnmsc.s\tr1, r2, r3, r4");

  Printed.clear();
  raw_string_ostream FcastuwSOS(Printed);
  InstPrinter->printInst(&FcastuwS, /*Address=*/0, /*Annot=*/"", *STI,
                         FcastuwSOS);
  FcastuwSOS.flush();
  EXPECT_EQ(Printed, "\tfcastuw.s\tr1, r2");

  Printed.clear();
  raw_string_ostream FcastswSOS(Printed);
  InstPrinter->printInst(&FcastswS, /*Address=*/0, /*Annot=*/"", *STI,
                         FcastswSOS);
  FcastswSOS.flush();
  EXPECT_EQ(Printed, "\tfcastsw.s\tr1, r2");

  Printed.clear();
  raw_string_ostream FcastrsUWOS(Printed);
  InstPrinter->printInst(&FcastrsUW, /*Address=*/0, /*Annot=*/"", *STI,
                         FcastrsUWOS);
  FcastrsUWOS.flush();
  EXPECT_EQ(Printed, "\tfcastrs.uw\tr1, r2");

  Printed.clear();
  raw_string_ostream FcastrsSWOS(Printed);
  InstPrinter->printInst(&FcastrsSW, /*Address=*/0, /*Annot=*/"", *STI,
                         FcastrsSWOS);
  FcastrsSWOS.flush();
  EXPECT_EQ(Printed, "\tfcastrs.sw\tr1, r2");

