cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream LdUHAlDisp9OS(Printed);
  InstPrinter->printInst(&LdUHAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         LdUHAlDisp9OS);
  LdUHAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tld.uhal\tr1, r2[6]");

  Printed.clear();
  raw_string_ostream IcallOS(Printed);
  InstPrinter->printInst(&Icall, /*Address=*/0, /*Annot=*/"", *STI, IcallOS);
  IcallOS.flush();
  EXPECT_EQ(Printed, "\ticall\tr1");

  Printed.clear();
  raw_string_ostream LdmOS(Printed);
  InstPrinter->printInst(&Ldm, /*Address=*/0, /*Annot=*/"", *STI, LdmOS);
  LdmOS.flush();
  EXPECT_EQ(Printed, "\tldm\tr1, r0-r3, lr");

  Printed.clear();
  raw_string_ostream LdmUpdOS(Printed);
  InstPrinter->printInst(&LdmUpd, /*Address=*/0, /*Annot=*/"", *STI,
                         LdmUpdOS);
  LdmUpdOS.flush();
  EXPECT_EQ(Printed, "\tldm\tr1++, r0-r3, lr");

  Printed.clear();
  raw_string_ostream LdmtsOS(Printed);
  InstPrinter->printInst(&Ldmts, /*Address=*/0, /*Annot=*/"", *STI, LdmtsOS);
  LdmtsOS.flush();
  EXPECT_EQ(Printed, "\tldmts\tr1, r0-r3, lr");

  Printed.clear();
  raw_string_ostream LdmtsUpdOS(Printed);
  InstPrinter->printInst(&LdmtsUpd, /*Address=*/0, /*Annot=*/"", *STI,
                         LdmtsUpdOS);
  LdmtsUpdOS.flush();
  EXPECT_EQ(Printed, "\tldmts\tr1++, r0-r3, lr");

  Printed.clear();
  raw_string_ostream LdcmDOS(Printed);
  InstPrinter->printInst(&LdcmD, /*Address=*/0, /*Annot=*/"", *STI, LdcmDOS);
  LdcmDOS.flush();
  EXPECT_EQ(Printed, "\tldcm.d\tcp2, r2, cr0-cr3");

  Printed.clear();
  raw_string_ostream LdcmDUpdOS(Printed);
  InstPrinter->printInst(&LdcmDUpd, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcmDUpdOS);
  LdcmDUpdOS.flush();
  EXPECT_EQ(Printed, "\tldcm.d\tcp2, r2++, cr0-cr3");

  Printed.clear();
  raw_string_ostream LdcmWLowOS(Printed);
  InstPrinter->printInst(&LdcmWLow, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcmWLowOS);
  LdcmWLowOS.flush();
  EXPECT_EQ(Printed, "\tldcm.w\tcp2, r2, cr2-cr5");

  Printed.clear();
  raw_string_ostream LdcmWHighUpdOS(Printed);
  InstPrinter->printInst(&LdcmWHighUpd, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcmWHighUpdOS);
  LdcmWHighUpdOS.flush();
  EXPECT_EQ(Printed, "\tldcm.w\tcp2, r2++, cr8-cr11");

  Printed.clear();
  raw_string_ostream StmOS(Printed);
  InstPrinter->printInst(&Stm, /*Address=*/0, /*Annot=*/"", *STI, StmOS);
  StmOS.flush();
  EXPECT_EQ(Printed, "\tstm\tr1, r0-r3, lr");

  Printed.clear();
  raw_string_ostream StmPreOS(Printed);
  InstPrinter->printInst(&StmPre, /*Address=*/0, /*Annot=*/"", *STI,
                         StmPreOS);
  StmPreOS.flush();
  EXPECT_EQ(Printed, "\tstm\t--r1, r0-r3, lr");

  Printed.clear();
  raw_string_ostream StmtsOS(Printed);
  InstPrinter->printInst(&Stmts, /*Address=*/0, /*Annot=*/"", *STI, StmtsOS);
  StmtsOS.flush();
  EXPECT_EQ(Printed, "\tstmts\tr1, r0-r3, lr");

  Printed.clear();
  raw_string_ostream StmtsPreOS(Printed);
  InstPrinter->printInst(&StmtsPre, /*Address=*/0, /*Annot=*/"", *STI,
                         StmtsPreOS);
  StmtsPreOS.flush();
  EXPECT_EQ(Printed, "\tstmts\t--r1, r0-r3, lr");

  Printed.clear();
  raw_string_ostream StcmDOS(Printed);
  InstPrinter->printInst(&StcmD, /*Address=*/0, /*Annot=*/"", *STI, StcmDOS);
  StcmDOS.flush();
  EXPECT_EQ(Printed, "\tstcm.d\tcp2, r2, cr0-cr3");

  Printed.clear();
  raw_string_ostream StcmDPreOS(Printed);
  InstPrinter->printInst(&StcmDPre, /*Address=*/0, /*Annot=*/"", *STI,
                         StcmDPreOS);
  StcmDPreOS.flush();
  EXPECT_EQ(Printed, "\tstcm.d\tcp2, --r2, cr0-cr3");

  Printed.clear();
  raw_string_ostream StcmWLowPreOS(Printed);
  InstPrinter->printInst(&StcmWLowPre, /*Address=*/0, /*Annot=*/"", *STI,
                         StcmWLowPreOS);
  StcmWLowPreOS.flush();
  EXPECT_EQ(Printed, "\tstcm.w\tcp2, --r2, cr2-cr5");

  Printed.clear();
  raw_string_ostream StcmWHighOS(Printed);
  InstPrinter->printInst(&StcmWHigh, /*Address=*/0, /*Annot=*/"", *STI,
                         StcmWHighOS);
  StcmWHighOS.flush();
  EXPECT_EQ(Printed, "\tstcm.w\tcp2, r2, cr8-cr11");

  Printed.clear();
  raw_string_ostream LslOS(Printed);
  InstPrinter->printInst(&Lsl, /*Address=*/0, /*Annot=*/"", *STI, LslOS);
  LslOS.flush();
  EXPECT_EQ(Printed, "\tlsl\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream LsrOS(Printed);
  InstPrinter->printInst(&Lsr, /*Address=*/0, /*Annot=*/"", *STI, LsrOS);
  LsrOS.flush();
  EXPECT_EQ(Printed, "\tlsr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MaxOS(Printed);
  InstPrinter->printInst(&Max, /*Address=*/0, /*Annot=*/"", *STI, MaxOS);
  MaxOS.flush();
  EXPECT_EQ(Printed, "\tmax\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MinOS(Printed);
  InstPrinter->printInst(&Min, /*Address=*/0, /*Annot=*/"", *STI, MinOS);
  MinOS.flush();
  EXPECT_EQ(Printed, "\tmin\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MfdrOS(Printed);
  InstPrinter->printInst(&Mfdr, /*Address=*/0, /*Annot=*/"", *STI, MfdrOS);
  MfdrOS.flush();
  EXPECT_EQ(Printed, "\tmfdr\tr1, 4");

  Printed.clear();
  raw_string_ostream MfsrOS(Printed);
  InstPrinter->printInst(&Mfsr, /*Address=*/0, /*Annot=*/"", *STI, MfsrOS);
  MfsrOS.flush();
  EXPECT_EQ(Printed, "\tmfsr\tr1, 4");

  Printed.clear();
  raw_string_ostream MulCompactOS(Printed);
  InstPrinter->printInst(&MulCompact, /*Address=*/0, /*Annot=*/"", *STI,
                         MulCompactOS);
  MulCompactOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2");

  Printed.clear();
  raw_string_ostream MulImmOS(Printed);
  InstPrinter->printInst(&MulImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MulImmOS);
  MulImmOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream MulOS(Printed);
  InstPrinter->printInst(&Mul, /*Address=*/0, /*Annot=*/"", *STI, MulOS);
  MulOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulsDOS(Printed);
  InstPrinter->printInst(&MulsD, /*Address=*/0, /*Annot=*/"", *STI, MulsDOS);
  MulsDOS.flush();
  EXPECT_EQ(Printed, "\tmuls.d\tr2, r3, r4");

