cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream PlsrBOS(Printed);
  InstPrinter->printInst(&PlsrB, /*Address=*/0, /*Annot=*/"", *STI, PlsrBOS);
  PlsrBOS.flush();
  EXPECT_EQ(Printed, "\tplsr.b\tr1, r2, 3");

  Printed.clear();
  raw_string_ostream PlsrHOS(Printed);
  InstPrinter->printInst(&PlsrH, /*Address=*/0, /*Annot=*/"", *STI, PlsrHOS);
  PlsrHOS.flush();
  EXPECT_EQ(Printed, "\tplsr.h\tr1, r2, 15");

  Printed.clear();
  raw_string_ostream PavgUBOS(Printed);
  InstPrinter->printInst(&PavgUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PavgUBOS);
  PavgUBOS.flush();
  EXPECT_EQ(Printed, "\tpavg.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PavgSHOS(Printed);
  InstPrinter->printInst(&PavgSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PavgSHOS);
  PavgSHOS.flush();
  EXPECT_EQ(Printed, "\tpavg.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PmaxUBOS(Printed);
  InstPrinter->printInst(&PmaxUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PmaxUBOS);
  PmaxUBOS.flush();
  EXPECT_EQ(Printed, "\tpmax.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PmaxSHOS(Printed);
  InstPrinter->printInst(&PmaxSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PmaxSHOS);
  PmaxSHOS.flush();
  EXPECT_EQ(Printed, "\tpmax.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PminUBOS(Printed);
  InstPrinter->printInst(&PminUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PminUBOS);
  PminUBOS.flush();
  EXPECT_EQ(Printed, "\tpmin.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PminSHOS(Printed);
  InstPrinter->printInst(&PminSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PminSHOS);
  PminSHOS.flush();
  EXPECT_EQ(Printed, "\tpmin.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsadOS(Printed);
  InstPrinter->printInst(&Psad, /*Address=*/0, /*Annot=*/"", *STI, PsadOS);
  PsadOS.flush();
  EXPECT_EQ(Printed, "\tpsad\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubBOS(Printed);
  InstPrinter->printInst(&PsubB, /*Address=*/0, /*Annot=*/"", *STI, PsubBOS);
  PsubBOS.flush();
  EXPECT_EQ(Printed, "\tpsub.b\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubHOS(Printed);
  InstPrinter->printInst(&PsubH, /*Address=*/0, /*Annot=*/"", *STI, PsubHOS);
  PsubHOS.flush();
  EXPECT_EQ(Printed, "\tpsub.h\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubaddHOS(Printed);
  InstPrinter->printInst(&PsubaddH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubaddHOS);
  PsubaddHOS.flush();
  EXPECT_EQ(Printed, "\tpsubadd.h\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PsubaddhSHOS(Printed);
  InstPrinter->printInst(&PsubaddhSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubaddhSHOS);
  PsubaddhSHOS.flush();
  EXPECT_EQ(Printed, "\tpsubaddh.sh\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PsubaddsUHOS(Printed);
  InstPrinter->printInst(&PsubaddsUH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubaddsUHOS);
  PsubaddsUHOS.flush();
  EXPECT_EQ(Printed, "\tpsubadds.uh\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PsubaddsSHOS(Printed);
  InstPrinter->printInst(&PsubaddsSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubaddsSHOS);
  PsubaddsSHOS.flush();
  EXPECT_EQ(Printed, "\tpsubadds.sh\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream PsubhUBOS(Printed);
  InstPrinter->printInst(&PsubhUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubhUBOS);
  PsubhUBOS.flush();
  EXPECT_EQ(Printed, "\tpsubh.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubhSHOS(Printed);
  InstPrinter->printInst(&PsubhSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubhSHOS);
  PsubhSHOS.flush();
  EXPECT_EQ(Printed, "\tpsubh.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubsUBOS(Printed);
  InstPrinter->printInst(&PsubsUB, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubsUBOS);
  PsubsUBOS.flush();
  EXPECT_EQ(Printed, "\tpsubs.ub\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubsSBOS(Printed);
  InstPrinter->printInst(&PsubsSB, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubsSBOS);
  PsubsSBOS.flush();
  EXPECT_EQ(Printed, "\tpsubs.sb\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubsUHOS(Printed);
  InstPrinter->printInst(&PsubsUH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubsUHOS);
  PsubsUHOS.flush();
  EXPECT_EQ(Printed, "\tpsubs.uh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubsSHOS(Printed);
  InstPrinter->printInst(&PsubsSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubsSHOS);
  PsubsSHOS.flush();
  EXPECT_EQ(Printed, "\tpsubs.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubxHOS(Printed);
  InstPrinter->printInst(&PsubxH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubxHOS);
  PsubxHOS.flush();
  EXPECT_EQ(Printed, "\tpsubx.h\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubxhSHOS(Printed);
  InstPrinter->printInst(&PsubxhSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubxhSHOS);
  PsubxhSHOS.flush();
  EXPECT_EQ(Printed, "\tpsubxh.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubxsUHOS(Printed);
  InstPrinter->printInst(&PsubxsUH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubxsUHOS);
  PsubxsUHOS.flush();
  EXPECT_EQ(Printed, "\tpsubxs.uh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PsubxsSHOS(Printed);
  InstPrinter->printInst(&PsubxsSH, /*Address=*/0, /*Annot=*/"", *STI,
                         PsubxsSHOS);
  PsubxsSHOS.flush();
  EXPECT_EQ(Printed, "\tpsubxs.sh\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PunpckubHOS(Printed);
  InstPrinter->printInst(&PunpckubH, /*Address=*/0, /*Annot=*/"", *STI,
                         PunpckubHOS);
  PunpckubHOS.flush();
  EXPECT_EQ(Printed, "\tpunpckub.h\tr1, r2:b");

