cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream StDRegOS(Printed);
  InstPrinter->printInst(&StDReg, /*Address=*/0, /*Annot=*/"", *STI, StDRegOS);
  StDRegOS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1, r2");

  Printed.clear();
  raw_string_ostream StDDisp16OS(Printed);
  InstPrinter->printInst(&StDDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StDDisp16OS);
  StDDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StDIndexShiftOS(Printed);
  InstPrinter->printInst(&StDIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StDIndexShiftOS);
  StDIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.d\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StHPostIncOS(Printed);
  InstPrinter->printInst(&StHPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StHPostIncOS);
  StHPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1++, r2");

  Printed.clear();
  raw_string_ostream StHPreDecOS(Printed);
  InstPrinter->printInst(&StHPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StHPreDecOS);
  StHPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.h\t--r1, r2");

  Printed.clear();
  raw_string_ostream StHDisp3OS(Printed);
  InstPrinter->printInst(&StHDisp3, /*Address=*/0, /*Annot=*/"", *STI,
                         StHDisp3OS);
  StHDisp3OS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1[6], r2");

  Printed.clear();
  raw_string_ostream StHDisp16OS(Printed);
  InstPrinter->printInst(&StHDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StHDisp16OS);
  StHDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StHIndexShiftOS(Printed);
  InstPrinter->printInst(&StHIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StHIndexShiftOS);
  StHIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.h\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StHEqDisp9OS(Printed);
  InstPrinter->printInst(&StHEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StHEqDisp9OS);
  StHEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.heq\tr1[6], r2");

  Printed.clear();
  raw_string_ostream StHAlDisp9OS(Printed);
  InstPrinter->printInst(&StHAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StHAlDisp9OS);
  StHAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.hal\tr1[6], r2");

  Printed.clear();
  raw_string_ostream StWPostIncOS(Printed);
  InstPrinter->printInst(&StWPostInc, /*Address=*/0, /*Annot=*/"", *STI,
                         StWPostIncOS);
  StWPostIncOS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1++, r2");

  Printed.clear();
  raw_string_ostream StWPreDecOS(Printed);
  InstPrinter->printInst(&StWPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         StWPreDecOS);
  StWPreDecOS.flush();
  EXPECT_EQ(Printed, "\tst.w\t--r1, r2");

  Printed.clear();
  raw_string_ostream StWDisp4OS(Printed);
  InstPrinter->printInst(&StWDisp4, /*Address=*/0, /*Annot=*/"", *STI,
                         StWDisp4OS);
  StWDisp4OS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1[12], r2");

  Printed.clear();
  raw_string_ostream StWDisp16OS(Printed);
  InstPrinter->printInst(&StWDisp16, /*Address=*/0, /*Annot=*/"", *STI,
                         StWDisp16OS);
  StWDisp16OS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StWIndexShiftOS(Printed);
  InstPrinter->printInst(&StWIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         StWIndexShiftOS);
  StWIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tst.w\tr1[r2 << 3], r4");

  Printed.clear();
  raw_string_ostream StWEqDisp9OS(Printed);
  InstPrinter->printInst(&StWEqDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StWEqDisp9OS);
  StWEqDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.weq\tr1[12], r2");

  Printed.clear();
  raw_string_ostream StWAlDisp9OS(Printed);
  InstPrinter->printInst(&StWAlDisp9, /*Address=*/0, /*Annot=*/"", *STI,
                         StWAlDisp9OS);
  StWAlDisp9OS.flush();
  EXPECT_EQ(Printed, "\tst.wal\tr1[12], r2");

  Printed.clear();
  raw_string_ostream StcondOS(Printed);
  InstPrinter->printInst(&Stcond, /*Address=*/0, /*Annot=*/"", *STI,
                         StcondOS);
  StcondOS.flush();
  EXPECT_EQ(Printed, "\tstcond\tr1[-1], r2");

  Printed.clear();
  raw_string_ostream StdspOS(Printed);
  InstPrinter->printInst(&Stdsp, /*Address=*/0, /*Annot=*/"", *STI, StdspOS);
  StdspOS.flush();
  EXPECT_EQ(Printed, "\tstdsp\tsp[12], r2");

  Printed.clear();
  raw_string_ostream SthhWDisp8OS(Printed);
  InstPrinter->printInst(&SthhWDisp8, /*Address=*/0, /*Annot=*/"", *STI,
                         SthhWDisp8OS);
  SthhWDisp8OS.flush();
  EXPECT_EQ(Printed, "\tsthh.w\tr1[12], r2:t, r3:b");

  Printed.clear();
  raw_string_ostream SthhWIndexShiftOS(Printed);
  InstPrinter->printInst(&SthhWIndexShift, /*Address=*/0, /*Annot=*/"",
                         *STI, SthhWIndexShiftOS);
  SthhWIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tsthh.w\tr1[r4 << 3], r2:t, r3:b");

  Printed.clear();
  raw_string_ostream StswpHDisp12OS(Printed);
  InstPrinter->printInst(&StswpHDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         StswpHDisp12OS);
  StswpHDisp12OS.flush();
  EXPECT_EQ(Printed, "\tstswp.h\tr1[-2], r2");

  Printed.clear();
  raw_string_ostream SubhhWOS(Printed);
  InstPrinter->printInst(&SubhhW, /*Address=*/0, /*Annot=*/"", *STI,
                         SubhhWOS);
  SubhhWOS.flush();
  EXPECT_EQ(Printed, "\tsubhh.w\tr1, r2:t, r3:b");

  Printed.clear();
  raw_string_ostream StswpWDisp12OS(Printed);
  InstPrinter->printInst(&StswpWDisp12, /*Address=*/0, /*Annot=*/"", *STI,
                         StswpWDisp12OS);
  StswpWDisp12OS.flush();
  EXPECT_EQ(Printed, "\tstswp.w\tr1[-4], r2");

  Printed.clear();
  raw_string_ostream ScallOS(Printed);
  InstPrinter->printInst(&Scall, /*Address=*/0, /*Annot=*/"", *STI, ScallOS);
  ScallOS.flush();
  EXPECT_EQ(Printed, "\tscall");

