cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream SscallOS(Printed);
  InstPrinter->printInst(&Sscall, /*Address=*/0, /*Annot=*/"", *STI,
                         SscallOS);
  SscallOS.flush();
  EXPECT_EQ(Printed, "\tsscall");

  Printed.clear();
  raw_string_ostream ScrOS(Printed);
  InstPrinter->printInst(&Scr, /*Address=*/0, /*Annot=*/"", *STI, ScrOS);
  ScrOS.flush();
  EXPECT_EQ(Printed, "\tscr\tr1");

  Printed.clear();
  raw_string_ostream SrEqOS(Printed);
  InstPrinter->printInst(&SrEq, /*Address=*/0, /*Annot=*/"", *STI, SrEqOS);
  SrEqOS.flush();
  EXPECT_EQ(Printed, "\tsreq\tr1");

  Printed.clear();
  raw_string_ostream SrAlOS(Printed);
  InstPrinter->printInst(&SrAl, /*Address=*/0, /*Annot=*/"", *STI, SrAlOS);
  SrAlOS.flush();
  EXPECT_EQ(Printed, "\tsral\tr1");

  Printed.clear();
  raw_string_ostream SleepOS(Printed);
  InstPrinter->printInst(&Sleep, /*Address=*/0, /*Annot=*/"", *STI, SleepOS);
  SleepOS.flush();
  EXPECT_EQ(Printed, "\tsleep\t1");

  Printed.clear();
  raw_string_ostream SsrfOS(Printed);
  InstPrinter->printInst(&Ssrf, /*Address=*/0, /*Annot=*/"", *STI, SsrfOS);
  SsrfOS.flush();
  EXPECT_EQ(Printed, "\tssrf\t1");

  Printed.clear();
  raw_string_ostream SubOS(Printed);
  InstPrinter->printInst(&Sub, /*Address=*/0, /*Annot=*/"", *STI, SubOS);
  SubOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SubImm8OS(Printed);
  InstPrinter->printInst(&SubImm8, /*Address=*/0, /*Annot=*/"", *STI,
                         SubImm8OS);
  SubImm8OS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, -1");

  Printed.clear();
  raw_string_ostream SubSPImm8OS(Printed);
  InstPrinter->printInst(&SubSPImm8, /*Address=*/0, /*Annot=*/"", *STI,
                         SubSPImm8OS);
  SubSPImm8OS.flush();
  EXPECT_EQ(Printed, "\tsub\tsp, -4");

  Printed.clear();
  raw_string_ostream SubShiftOS(Printed);
  InstPrinter->printInst(&SubShift, /*Address=*/0, /*Annot=*/"", *STI,
                         SubShiftOS);
  SubShiftOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2, r3 << 2");

  Printed.clear();
  raw_string_ostream SubRegImm16OS(Printed);
  InstPrinter->printInst(&SubRegImm16, /*Address=*/0, /*Annot=*/"", *STI,
                         SubRegImm16OS);
  SubRegImm16OS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream SubImmOS(Printed);
  InstPrinter->printInst(&SubImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubImmOS);
  SubImmOS.flush();
  EXPECT_EQ(Printed, "\tsub\tr1, -1");

  Printed.clear();
  raw_string_ostream SubEqOS(Printed);
  InstPrinter->printInst(&SubEq, /*Address=*/0, /*Annot=*/"", *STI, SubEqOS);
  SubEqOS.flush();
  EXPECT_EQ(Printed, "\tsubeq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SubAlOS(Printed);
  InstPrinter->printInst(&SubAl, /*Address=*/0, /*Annot=*/"", *STI, SubAlOS);
  SubAlOS.flush();
  EXPECT_EQ(Printed, "\tsubal\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SubEqImmOS(Printed);
  InstPrinter->printInst(&SubEqImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubEqImmOS);
  SubEqImmOS.flush();
  EXPECT_EQ(Printed, "\tsubeq\tr1, -1");

  Printed.clear();
  raw_string_ostream SubAlImmOS(Printed);
  InstPrinter->printInst(&SubAlImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubAlImmOS);
  SubAlImmOS.flush();
  EXPECT_EQ(Printed, "\tsubal\tr1, -1");

  Printed.clear();
  raw_string_ostream SubfEqImmOS(Printed);
  InstPrinter->printInst(&SubfEqImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubfEqImmOS);
  SubfEqImmOS.flush();
  EXPECT_EQ(Printed, "\tsubfeq\tr1, -1");

  Printed.clear();
  raw_string_ostream SubfAlImmOS(Printed);
  InstPrinter->printInst(&SubfAlImm, /*Address=*/0, /*Annot=*/"", *STI,
                         SubfAlImmOS);
  SubfAlImmOS.flush();
  EXPECT_EQ(Printed, "\tsubfal\tr1, -1");

  Printed.clear();
  raw_string_ostream SwapBHOS(Printed);
  InstPrinter->printInst(&SwapBH, /*Address=*/0, /*Annot=*/"", *STI, SwapBHOS);
  SwapBHOS.flush();
  EXPECT_EQ(Printed, "\tswap.bh\tr1");

  Printed.clear();
  raw_string_ostream SwapBOS(Printed);
  InstPrinter->printInst(&SwapB, /*Address=*/0, /*Annot=*/"", *STI, SwapBOS);
  SwapBOS.flush();
  EXPECT_EQ(Printed, "\tswap.b\tr1");

  Printed.clear();
  raw_string_ostream SwapHOS(Printed);
  InstPrinter->printInst(&SwapH, /*Address=*/0, /*Annot=*/"", *STI, SwapHOS);
  SwapHOS.flush();
  EXPECT_EQ(Printed, "\tswap.h\tr1");

  Printed.clear();
  raw_string_ostream SyncOS(Printed);
  InstPrinter->printInst(&Sync, /*Address=*/0, /*Annot=*/"", *STI, SyncOS);
  SyncOS.flush();
  EXPECT_EQ(Printed, "\tsync\t1");

  Printed.clear();
  raw_string_ostream TlbrOS(Printed);
  InstPrinter->printInst(&Tlbr, /*Address=*/0, /*Annot=*/"", *STI, TlbrOS);
  TlbrOS.flush();
  EXPECT_EQ(Printed, "\ttlbr");

  Printed.clear();
  raw_string_ostream TlbsOS(Printed);
  InstPrinter->printInst(&Tlbs, /*Address=*/0, /*Annot=*/"", *STI, TlbsOS);
  TlbsOS.flush();
  EXPECT_EQ(Printed, "\ttlbs");

  Printed.clear();
  raw_string_ostream TlbwOS(Printed);
  InstPrinter->printInst(&Tlbw, /*Address=*/0, /*Annot=*/"", *STI, TlbwOS);
  TlbwOS.flush();
  EXPECT_EQ(Printed, "\ttlbw");

  Printed.clear();
  raw_string_ostream TnbzOS(Printed);
  InstPrinter->printInst(&Tnbz, /*Address=*/0, /*Annot=*/"", *STI, TnbzOS);
  TnbzOS.flush();
  EXPECT_EQ(Printed, "\ttnbz\tr1");

  Printed.clear();
  raw_string_ostream TstOS(Printed);
  InstPrinter->printInst(&Tst, /*Address=*/0, /*Annot=*/"", *STI, TstOS);
  TstOS.flush();
  EXPECT_EQ(Printed, "\ttst\tr1, r2");

  Printed.clear();
  raw_string_ostream XchgOS(Printed);
  InstPrinter->printInst(&Xchg, /*Address=*/0, /*Annot=*/"", *STI, XchgOS);
  XchgOS.flush();
  EXPECT_EQ(Printed, "\txchg\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MovOS(Printed);
  InstPrinter->printInst(&Mov, /*Address=*/0, /*Annot=*/"", *STI, MovOS);
  MovOS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, r2");

  Printed.clear();
  raw_string_ostream MovEqOS(Printed);
  InstPrinter->printInst(&MovEq, /*Address=*/0, /*Annot=*/"", *STI, MovEqOS);
  MovEqOS.flush();
  EXPECT_EQ(Printed, "\tmoveq\tr1, r2");

