cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream MovAlOS(Printed);
  InstPrinter->printInst(&MovAl, /*Address=*/0, /*Annot=*/"", *STI, MovAlOS);
  MovAlOS.flush();
  EXPECT_EQ(Printed, "\tmoval\tr1, r2");

  Printed.clear();
  raw_string_ostream MovEqImmOS(Printed);
  InstPrinter->printInst(&MovEqImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MovEqImmOS);
  MovEqImmOS.flush();
  EXPECT_EQ(Printed, "\tmoveq\tr1, -1");

  Printed.clear();
  raw_string_ostream MovAlImmOS(Printed);
  InstPrinter->printInst(&MovAlImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MovAlImmOS);
  MovAlImmOS.flush();
  EXPECT_EQ(Printed, "\tmoval\tr1, -1");

  Printed.clear();
  raw_string_ostream MovImmOS(Printed);
  InstPrinter->printInst(&MovImm, /*Address=*/0, /*Annot=*/"", *STI, MovImmOS);
  MovImmOS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, -1");

  Printed.clear();
  raw_string_ostream MovImm21OS(Printed);
  InstPrinter->printInst(&MovImm21, /*Address=*/0, /*Annot=*/"", *STI,
                         MovImm21OS);
  MovImm21OS.flush();
  EXPECT_EQ(Printed, "\tmov\tr1, 32");

  Printed.clear();
  raw_string_ostream MovhOS(Printed);
  InstPrinter->printInst(&Movh, /*Address=*/0, /*Annot=*/"", *STI, MovhOS);
  MovhOS.flush();
  EXPECT_EQ(Printed, "\tmovh\tr1, 1");

  Printed.clear();
  raw_string_ostream CopOS(Printed);
  InstPrinter->printInst(&Cop, /*Address=*/0, /*Annot=*/"", *STI, CopOS);
  CopOS.flush();
  EXPECT_EQ(Printed, "\tcop\tcp2, cr1, cr3, cr4, 85");

  Printed.clear();
  raw_string_ostream Picovmul3OS(Printed);
  InstPrinter->printInst(&Picovmul3, /*Address=*/0, /*Annot=*/"", *STI,
                         Picovmul3OS);
  Picovmul3OS.flush();
  EXPECT_EQ(Printed, "\tpicovmul\tout3, in9, in10, in11");

  Printed.clear();
  raw_string_ostream Picovmac3OS(Printed);
  InstPrinter->printInst(&Picovmac3, /*Address=*/0, /*Annot=*/"", *STI,
                         Picovmac3OS);
  Picovmac3OS.flush();
  EXPECT_EQ(Printed, "\tpicovmac\tout3, in9, in10, in11");

  Printed.clear();
  raw_string_ostream Picosvmul3OS(Printed);
  InstPrinter->printInst(&Picosvmul3, /*Address=*/0, /*Annot=*/"", *STI,
                         Picosvmul3OS);
  Picosvmul3OS.flush();
  EXPECT_EQ(Printed, "\tpicosvmul\tout3, in9, in10, in11");

  Printed.clear();
  raw_string_ostream Picosvmac3OS(Printed);
  InstPrinter->printInst(&Picosvmac3, /*Address=*/0, /*Annot=*/"", *STI,
                         Picosvmac3OS);
  Picosvmac3OS.flush();
  EXPECT_EQ(Printed, "\tpicosvmac\tout3, in9, in10, in11");

  Printed.clear();
  raw_string_ostream PicomvDFromRegOS(Printed);
  InstPrinter->printInst(&PicomvDFromReg, /*Address=*/0, /*Annot=*/"", *STI,
                         PicomvDFromRegOS);
  PicomvDFromRegOS.flush();
  EXPECT_EQ(Printed, "\tpicomv.d\tvmu2_out, lr");

  Printed.clear();
  raw_string_ostream PicomvDToRegOS(Printed);
  InstPrinter->printInst(&PicomvDToReg, /*Address=*/0, /*Annot=*/"", *STI,
                         PicomvDToRegOS);
  PicomvDToRegOS.flush();
  EXPECT_EQ(Printed, "\tpicomv.d\tlr, vmu2_out");

  Printed.clear();
  raw_string_ostream PicomvWFromRegOS(Printed);
  InstPrinter->printInst(&PicomvWFromReg, /*Address=*/0, /*Annot=*/"", *STI,
                         PicomvWFromRegOS);
  PicomvWFromRegOS.flush();
  EXPECT_EQ(Printed, "\tpicomv.w\tconfig, pc");

  Printed.clear();
  raw_string_ostream PicomvWToRegOS(Printed);
  InstPrinter->printInst(&PicomvWToReg, /*Address=*/0, /*Annot=*/"", *STI,
                         PicomvWToRegOS);
  PicomvWToRegOS.flush();
  EXPECT_EQ(Printed, "\tpicomv.w\tr0, inpix2");

  Printed.clear();
  raw_string_ostream MvcrDOS(Printed);
  InstPrinter->printInst(&MvcrD, /*Address=*/0, /*Annot=*/"", *STI, MvcrDOS);
  MvcrDOS.flush();
  EXPECT_EQ(Printed, "\tmvcr.d\tcp2, r0, cr2");

  Printed.clear();
  raw_string_ostream MvcrWOS(Printed);
  InstPrinter->printInst(&MvcrW, /*Address=*/0, /*Annot=*/"", *STI, MvcrWOS);
  MvcrWOS.flush();
  EXPECT_EQ(Printed, "\tmvcr.w\tcp2, r1, cr3");

  Printed.clear();
  raw_string_ostream MvrcDOS(Printed);
  InstPrinter->printInst(&MvrcD, /*Address=*/0, /*Annot=*/"", *STI, MvrcDOS);
  MvrcDOS.flush();
  EXPECT_EQ(Printed, "\tmvrc.d\tcp2, cr0, r2");

  Printed.clear();
  raw_string_ostream MvrcWOS(Printed);
  InstPrinter->printInst(&MvrcW, /*Address=*/0, /*Annot=*/"", *STI, MvrcWOS);
  MvrcWOS.flush();
  EXPECT_EQ(Printed, "\tmvrc.w\tcp2, cr3, r1");

  Printed.clear();
  raw_string_ostream LdcDDispOS(Printed);
  InstPrinter->printInst(&LdcDDisp, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcDDispOS);
  LdcDDispOS.flush();
  EXPECT_EQ(Printed, "\tldc.d\tcp2, cr0, r2[0]");

  Printed.clear();
  raw_string_ostream LdcDPreDecOS(Printed);
  InstPrinter->printInst(&LdcDPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcDPreDecOS);
  LdcDPreDecOS.flush();
  EXPECT_EQ(Printed, "\tldc.d\tcp2, cr0, --r2");

  Printed.clear();
  raw_string_ostream LdcDIndexShiftOS(Printed);
  InstPrinter->printInst(&LdcDIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcDIndexShiftOS);
  LdcDIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tldc.d\tcp2, cr0, r2[r3 << 1]");

  Printed.clear();
  raw_string_ostream LdcWDispOS(Printed);
  InstPrinter->printInst(&LdcWDisp, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcWDispOS);
  LdcWDispOS.flush();
  EXPECT_EQ(Printed, "\tldc.w\tcp2, cr3, r2[4]");

  Printed.clear();
  raw_string_ostream LdcWPreDecOS(Printed);
  InstPrinter->printInst(&LdcWPreDec, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcWPreDecOS);
  LdcWPreDecOS.flush();
  EXPECT_EQ(Printed, "\tldc.w\tcp2, cr3, --r2");

  Printed.clear();
  raw_string_ostream LdcWIndexShiftOS(Printed);
  InstPrinter->printInst(&LdcWIndexShift, /*Address=*/0, /*Annot=*/"", *STI,
                         LdcWIndexShiftOS);
  LdcWIndexShiftOS.flush();
  EXPECT_EQ(Printed, "\tldc.w\tcp2, cr3, r2[r3 << 2]");

  Printed.clear();
  raw_string_ostream PicoldDDispOS(Printed);
  InstPrinter->printInst(&PicoldDDisp, /*Address=*/0, /*Annot=*/"", *STI,
                         PicoldDDispOS);
  PicoldDDispOS.flush();
  EXPECT_EQ(Printed, "\tpicold.d\tvmu2_out, pc[1020]");

